; domain
(define (domain blocks)
  (:requirements :strips :equality :disjunctive-preconditions :derived-predicates :negative-preconditions :conditional-effects :existential-preconditions :typing)

  (:types
    robot block - object
  )

  (:predicates 
    (on ?block1 - block ?block2 - block)
    (ontable ?block - block)
    (clear ?block - block)
    (KBquery_fullHands ?robot - robot)
    (holding ?robot - robot ?block - block)
  )

  (:action pick-up
    :parameters (?robot - robot ?block - block)
    :precondition (and 
      (clear ?block) 
      (ontable ?block) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (not (ontable ?block))
        (not (clear ?block))
        (holding ?robot ?block)
      )
  )

  (:action put-down
    :parameters (?robot - robot ?block - block)
    :precondition (holding ?robot ?block)
    :effect
      (and 
        (not (holding ?robot ?block))
        (clear ?block)
        (ontable ?block)
      )
  )

  (:action stack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (holding ?robot ?block1) 
      (clear ?block2)
      )
    :effect
      (and 
        (not (holding ?robot ?block1))
        (not (clear ?block2))
        (clear ?block1)
        (on ?block1 ?block2)
      )
  )

  (:action unstack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (on ?block1 ?block2) 
      (clear ?block1) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (holding ?robot ?block1)
        (clear ?block2)
        (not (clear ?block1))
        (not (on ?block2 ?block1))
      )
  )
)

; problem
(define (problem BLOCKS-4-1)
(:domain BLOCKS)
(:objects B D A C - block pr2 - robot)
(:INIT (CLEAR B) (ONTABLE D) (ON B C) (ON C A) (ON A D))
(:goal (AND (ON D C) (ON C A) (ON A B)))
)

; plan
1. (unstack pr2 b c)
   deleted: (clear b)
   added: (holding pr2 b) (clear c)
   goals met: 1 of 3
2. (unstack pr2 c a)
   deleted: (clear c)
   added: (holding pr2 c) (clear a)
   goals met: 1 of 3
3. (put-down pr2 b)
   deleted: (holding pr2 b)
   added: (clear b) (ontable b)
   goals met: 1 of 3
4. (unstack pr2 a d)
   deleted: (clear a)
   added: (holding pr2 a) (clear d)
   goals met: 1 of 3
5. (stack pr2 a b)
   deleted: (holding pr2 a) (clear b)
   added: (clear a) (on a b)
   goals met: 2 of 3
6. (pick-up pr2 d)
   deleted: (ontable d) (clear d)
   added: (holding pr2 d)
   goals met: 2 of 3
7. (stack pr2 c a)
   deleted: (holding pr2 c) (clear a)
   added: (clear c)
   goals met: 2 of 3
8. (stack pr2 d c)
   deleted: (holding pr2 d) (clear c)
   added: (clear d) (on d c)
   goals met: 3 of 3
